import type { ColorIconProps } from '@/types/icon';

/**
 * Tastes 아이콘 컴포넌트
 *
 * @component
 * @param {number|string} [props.size=40] - 아이콘의 크기 (px 또는 rem 등)
 * @param {string} [props.color='#CFDBEA'] - 아이콘의 색상
 * @returns {JSX.Element} SVG 아이콘
 *
 * @example
 * ```tsx
 * <TasteIcon />
 * <TasteIcon size={48} color="#000" />
 * ```
 */

export default function HoneyIcon({
  size = 40,
  color = '#CFDBEA',
}: ColorIconProps) {
  return (
    <svg
      fill='none'
      height={size}
      viewBox='0 0 40 40'
      width={size}
      xmlns='http://www.w3.org/2000/svg'
    >
      <g clip-path='url(#clip0_1_2919)'>
        <path
          d='M38.8281 0H33.3334C30.3878 0 28 2.38781 28 5.33336H38.8281C39.4753 5.33336 40 4.80867 40 4.16148V1.17188C40 0.524687 39.4753 0 38.8281 0V0Z'
          fill={color}
        />
        <path
          d='M30.6666 2.66531C30.6666 1.19336 31.8599 0 33.3334 0H2.66664C1.19328 0 0 1.19336 0 2.66531C0 3.73328 0.18375 6.84891 2.83336 9.49461L5.5 12.1613C6.24664 12.912 6.66664 13.9293 6.66664 14.99V21.3334C6.66664 22.806 7.86656 24 9.33328 24C10.8066 24 11.9999 22.806 11.9999 21.3334C11.9999 19.8607 13.1998 18.6667 14.6666 18.6667C16.1398 18.6667 17.3332 19.8607 17.3332 21.3334V37.3334C17.3332 38.806 18.5331 40 19.9998 40C21.4731 40 22.6665 38.806 22.6665 37.3334V10.6654C22.6665 7.74813 25.04 5.33336 27.9998 5.33336C29.4647 5.33336 30.6666 4.1482 30.6666 2.66531Z'
          fill={color}
        />
        <path
          d='M14.6667 18.6666C16.14 18.6666 17.3334 19.8606 17.3334 21.3333V37.3333C17.3334 38.8059 18.5333 39.9999 20 39.9999C21.4733 39.9999 22.6667 38.8059 22.6667 37.3333V10.6653C22.6667 7.74805 25.0402 5.33328 28 5.33328C29.4647 5.33328 30.6667 4.14813 30.6667 2.66531C30.6667 1.19336 31.86 0 33.3335 0H14.6667V18.6666Z'
          fill={color}
        />
      </g>
      <defs>
        <clipPath id='clip0_1_2919'>
          <rect fill='white' height={size} width={size} />
        </clipPath>
      </defs>
    </svg>
  );
}
